Carte_old/app/controllers/regions_controller.rb

  def index
    regions = Region.all
---
SELECT "regions".* FROM "regions"