Carte/app/controllers/categories_controller.rb

  def index
    categories = Category.where(restaurant_id: params[:restaurant_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."restaurant_id" IS NULL

  def show
    category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]